Name

Labpartner(s)

In [1]:
#import statements go here
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

# Class 9.2

# Warmups 9.2

It was so much fun working together on Monday we will do it again. Spend 15 min working on the following and then we will go over it together:

**W.1** Write a function that returns the first n consectutive odd intergers (ex: 1,3,5,7,9 for n = 5) using only logical control (i.e. don't use indexing short cuts to make the odd integers, only for or while loops)

In [2]:
def odd(x):
    oddrange= np.arange(1,x*2,2)
    return oddrange

In [3]:
odd(5)

array([1, 3, 5, 7, 9])

In [5]:
n=7
start=1
mylist=[start]
newnum=start
while n>1:
    n = n-1
    print('n=' + str(n))
    
    nextnum = newnum+2
    print(nextnum)
    
    mylist = mylist + [nextnum]
    print(mylist)
    
    newnum = nextnum
    print(newnum)

n=6
3
[1, 3]
3
n=5
5
[1, 3, 5]
5
n=4
7
[1, 3, 5, 7]
7
n=3
9
[1, 3, 5, 7, 9]
9
n=2
11
[1, 3, 5, 7, 9, 11]
11
n=1
13
[1, 3, 5, 7, 9, 11, 13]
13

In [6]:
def oddnumb(counter):
    n=counter
    start=1
    mylist=[start]
    newnum=start
    
    while n>1:
        n = n-1
        nextnum = newnum+2
        mylist = mylist + [nextnum]
        newnum = nextnum
    
    return mylist

In [7]:
oddnumb(5)

[1, 3, 5, 7, 9]

In [8]:
oddnumb(-5)

[1]

In [9]:
oddnumb(10)

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19]

#### Scratch

In [24]:
# trick to initilize as a list
my_list = []

In [18]:
my_list = [start]

In [25]:
type(my_list)

list

In [23]:
start =1 # first number
#initialize my list with the first number

my_list = [start] #define my_list as a list to start with, so we can append things to it
#my_list = start 

next_num = start+2 # 3

# add next_num to my_list
#my_list.append(next_num)
my_list = my_list + [next_num]


print(my_list)
#print(next_num)

[1, 3]

In [22]:
[4, 5] + [7, 8]

[4, 5, 7, 8]

**Extra:** Modify your function so that it can start anywhere. That is, add a second input that gives a starting integer. Ex: 7,9,11 for n = 3 and a starting value of 7

For Monday: do the extra, do evens, add user input

In [10]:
def oddnumb2(counter):
    n= counter
    start=3
    mylist=[start]
    newnum=start
    
    while n>1:
        n= n-1
        nextnum = newnum+2
        mylist = mylist+[nextnum]
        newnum=nextnum
        
    return mylist

In [11]:
oddnumb2(3)

[3, 5, 7]

# Lecture 9.2

### Agenda:
- Research project assignment and what is due this week
- Links to previous class githubs are in our github in the resources document in the Course Materials folder: https://github.com/chsharrison/IntroSciComp_S2021/blob/main/Class_materials/resources.md

#### Reminders
- Many of you need to make up "show us your functions" we will do this in office hours or by appointment. I want to make sure everyone gets this function syntax down. See column in BB for above. Many of you need to redo this.
- To get tokens for turning in labs or finishing datacamp chapters early, you need to send me and Adrian a message on slack (see instructions I gave you, on blackboard and in previous labs). We won't notice unless you tell us to look.

### Questions

# Lab 9.2

**E.1** Complete Data Manipulation with pandas Ch 4 in datacamp.

**E.2** Make notes for yourself on progamming tecniques and commands you learned in the datacamp chapter above, including examples, comments and explainitory text. You can do this here or in a separate notebook that you link to here. Basically, you are making a cheat sheet for yourself.

### This week's project:

This week you will be doing two things, planning on what grade you will get in this course (due Thursday with lab 9.1) and submitting your research topic (due Sunday with lab 9.2).

**E.4** Write a few sentances about what you plan to do for your research project. See tab in BB to turn this in

PRACTICE

In [13]:
file=pd.read_csv('RiverData.csv', index_col='Year')
file

            SSC  Flow
Year
1966.0   730.00  34.3
1967.0   907.60  72.8
1971.0  4110.00  78.0
1972.0   839.33  25.7
1973.0   535.88  94.7
...         ...   ...
2016.0    31.60   NaN
2017.0    36.40   NaN
2018.0    36.00   NaN
2019.0    42.80   NaN
2020.0    17.90   NaN

[11407 rows x 2 columns]

In [15]:
new_file=file.dropna()
new_file

            SSC  Flow
Year
1966.0   730.00  34.3
1967.0   907.60  72.8
1971.0  4110.00  78.0
1972.0   839.33  25.7
1973.0   535.88  94.7
...         ...   ...
2007.0    18.56  13.6
2008.0    47.83  24.6
2009.0    24.50   8.5
2010.0    99.91  68.1
2011.0    53.55  17.1

[86 rows x 2 columns]

In [16]:
new_file2=file.fillna(0)
new_file2

            SSC  Flow
Year
1966.0   730.00  34.3
1967.0   907.60  72.8
1971.0  4110.00  78.0
1972.0   839.33  25.7
1973.0   535.88  94.7
...         ...   ...
2016.0    31.60   0.0
2017.0    36.40   0.0
2018.0    36.00   0.0
2019.0    42.80   0.0
2020.0    17.90   0.0

[11407 rows x 2 columns]

In [17]:
file.isna()

          SSC   Flow
Year
1966.0  False  False
1967.0  False  False
1971.0  False  False
1972.0  False  False
1973.0  False  False
...       ...    ...
2016.0  False   True
2017.0  False   True
2018.0  False   True
2019.0  False   True
2020.0  False   True

[11407 rows x 2 columns]

In [ ]:
data.isna